# MomentOfInertiaStrongAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSection..::..MomentOfInertiaStrongAxis Property
StructuralSection Class See Also
---
Moment of Inertia about main strong axis (I).
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double MomentOfInertiaStrongAxis { get; set; }
```

Visual Basic
---
```text
Public Property MomentOfInertiaStrongAxis As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double MomentOfInertiaStrongAxis {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace